print('\n')

'''Исходные данные.'''
score = [[5, 3, 3, 5, 4], [2, 2, 2, 3], [4, 5, 5, 2], [4, 4, 3], [5, 5, 5, 4, 5]]
students_set = {'Джонни', 'Бильбо', 'Стив', 'Хендрик', 'Аарон'}

'''Создаём словарь отображения среднего балла.'''
average_score = {}

'''Превращаем набор (множество) в список.'''
student_list = list({'Джонни','Бильбо','Стив','Хендрик','Аарон'})

'''Сортируем список студентов.'''
student_sort=(sorted(student_list))

'''Добавляем пары в словарь.'''
i=0
for i in range(len(score)):
    average_score[student_sort[i]]=sum(score[i])/len(score[i])

'''Выводим словарь на экран.'''
print(average_score)
